import './Team.scss'

function Team() {
  const teamMembers = [
    {
      name: 'Ганна Толстанова',
      photoSrc: './img/team/Tolstanova.png',
      photoAlt: '#',
      description:
        'доктор біологічних наук, професор, експерт в галузі: організації науки, керівництво проєктами, докторські школи',
      message:
        "«Сьогодні кожен українець обороняє нашу країну на своєму фронті. Під час повномасштабного вторгнення росії на територію України ми стали ще більш згуртовані, відчули нашу цілісність й силу, а також підтримку всього демократичного світу. Для реалізації освітнього та наукового потенціалу без обмежень та кордонів активні освітяни та науковці об'єдналися та створили першу українсько-європейську спільноту Професійна мережа менеджерів освіти і науки України»",
    },
    {
      name: 'Ольга ПЕТРУНІНА',
      photoSrc: './img/team/Petrunina.png',
      photoAlt: '#',
      description:
        'експерт з питання грантової підтримки, реалізації проектів.',
      message:
        ' «У цей час для країни важливим є підтримка і розвиток кожної сфери, але працюючи над розвитком освіти, науки та інновацій ми маємо можливість планувати майбутнє нашої країни, готувати потужний кадровий потенціал». ',
    },
    {
      name: 'Наталія БОВТРУК',
      photoSrc: './img/team/Bovtruk.png',
      photoAlt: '#',
      description: 'комунікаційний експерт сфери освіти, науки та інновацій.',
      message:
        ' “Для формування освітян та науковців важливо налагодити професійні комунікації, як стануть важливим підґрунтям для обміну досвідом, співпраці заради розвитку та становлення сфери освіти, науки та інновацій. Це своєю чергою стане неоціненною зброєю нашого фронту”',
    },
    {
      name: 'Вікторія ГУРА',
      photoSrc: './img/team/Gura.png',
      photoAlt: '#',
      description:
        'експерт з питань організації навчального процесу та репутаційного менеджменту.',
      message:
        '“Без якісної освіти немає майбутнього. Ми живемо у важкі часи. Ніхто не вірив, що сусід може напасти на нас. Проте мужньо тримаємо освітній фронт. І навчаємо якісно та професійно. Війна - це страшно, але потрібно рухатися вперед та розвиватися, щоб відновити країну та повернутися до мирного життя. Спільними зусиллями ми відбудуємо та розбудуємо Україну, адже це наша рідна земля. Запрошую долучитися до нашої команди та рухатися вперед до Перемоги разом”.',
    },
    {
      name: 'Оксана КРУКЕВИЧ',
      photoSrc: './img/team/Krukevych.png',
      photoAlt: '#',
      description:
        'експерт з питань управління та фінансування науки, взаємодії науки та бізнесу, розвитку інновацій та трансферу технологій.',
      message:
        ' “Україна щодня демонструє свою сміливість та героїчно протистоїть російській агресії, невпинно працює над подолання впливу загарбницьких дій рф, чим щодня доводить світу свою силу та міць. Безперечно Перемога за нами, але на жаль маємо багато руйнувань та втрат, які потребують якнайшвидшого відновлення.   і Сьогоднішні реалії також вимагають нових механізмів розвитку нашої країни, а саме  інноваційної, високотехнологічної та інвестиційно привабливих напрямів держави. Ми маємо неймовірний інтелектуальний, науковий та інноваційний потенціал, який потребує підтримки, злагоджених дій та взаємодії державних органів, наукової спільноти та бізнесу, І єдина Мережа в Україні відкриває такі можливості.”',
    },
    {
      name: 'Юлія ЛИХАЧОВА',
      photoSrc: './img/team/Lykhachova.png',
      photoAlt: '#',
      description: 'експерт з питань розвитку інновацій.',
      message:
        'Сьогодення вимагає сучасних і швидких рішень. Саме тому створено мережу, яка обєднає в собі значний інтелектуальний потенціал для відбудови України інноваційним шляхом',
    },
    {
      name: 'Олена ПОЧАЄВЕЦЬ',
      photoSrc: './img/team/Pochaevets.png',
      photoAlt: '#',
      description:
        ' експерт з питань грантової діяльності, управління проєктами.',
      message:
        ' «Професійна діяльність майже кожного освітянина й науковця це проєктна діяльність. Особливість проєктів в тому, що вони мають свій початок і кінець, мають задачі, і ресурси для їх реалізації. Мати ідею та уміння ефективно реалізовувати проєкти, а особливо в умовах невизначеності, - наша особлива суперсила. Мережа дає можливість підвищити рівень суперсили, а отже всі ми - супергерої освітнього та наукового фронту».',
    },
    {
      name: 'Наталія ШАЛІМОВА',
      photoSrc: './img/team/Shalimova.png',
      photoAlt: '#',
      description: 'Секретар мережі.',
      message:
        '“Задля розвитку нашої країни, її наукового та освітнього потенціалу маємо  працювати систематично, а не ситуативно. Мережа створює можливості для спільного пошуку нових підходів, ідей, рішень, для обміну досвідом та кращими практиками на національному та міжнародному рівнях”.',
    },
    {
      name: 'Катерина КОНОВАЛОВА',
      photoSrc: './img/team/Konovalova.png',
      photoAlt: '#',
      description: 'Дизайнер',
      message:
        '"Сучасність, чіткість та інноваційність диктують тренди. Мережа менеджерів відкриває нові можливості для розвитку країни, транслює увагу до деталей, професіоналізм та виваженість, що знаходить своє відображення у візуальній частині мережі".',
    },
    {
      name: 'Дмитро ГОРОБЕЦЬ',
      photoSrc: './img/team/Gorobets.png',
      photoAlt: '#',
      description: 'Front-end розробник, Розробник сайт',
      message:
        '"Час - це цінний ресурс, якого завжди бракує. Ця мережа є, свого роду, майданчиком для швидкого пошуку співпраці та взаємодії і комунікації між активними науковцями та освітянами."',
    },
  ]

  return (
    <div className="container">
      {teamMembers.map((member, index) => (
        <div key={index}>
          <img
            width={350}
            height={350}
            src={member.photoSrc}
            alt={member.photoAlt}
          />
          <h2>{member.name}</h2>
          <p>{member.description}</p>
          <p>{member.message}</p>
        </div>
      ))}
    </div>
  )
}

export default Team
